#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.k3s-bootstrap-rg will be created
  + resource "azurerm_resource_group" "k3s-bootstrap-rg" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "k3s-bootstrap"
      + tags     = (known after apply)
    }

  # null_resource.ansible-playbook will be created
  + resource "null_resource" "ansible-playbook" {
      + id = (known after apply)
    }

  # module.azure-network.azurerm_subnet.k3s-bootstrap-subnet will be created
  + resource "azurerm_subnet" "k3s-bootstrap-subnet" {
      + address_prefix                                 = "172.16.12.0/24"
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + ip_configurations                              = (known after apply)
      + name                                           = "default"
      + resource_group_name                            = "k3s-bootstrap"
      + virtual_network_name                           = "k3s-bootstrap-vnet"
    }

  # module.azure-network.azurerm_virtual_network.k3s-bootstrap-vnet will be created
  + resource "azurerm_virtual_network" "k3s-bootstrap-vnet" {
      + address_space       = [
          + "172.16.12.0/22",
        ]
      + id                  = (known after apply)
      + location            = "eastus2"
      + name                = "k3s-bootstrap-vnet"
      + resource_group_name = "k3s-bootstrap"
      + tags                = (known after apply)

      + subnet {
          + address_prefix = (known after apply)
          + id             = (known after apply)
          + name           = (known after apply)
          + security_group = (known after apply)
        }
    }

  # module.azure-vms.azurerm_network_interface.k3s-bootstrap-nic["k3s-bootstrap-0"] will be created
  + resource "azurerm_network_interface" "k3s-bootstrap-nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_fqdn                 = (known after apply)
      + location                      = "eastus2"
      + mac_address                   = (known after apply)
      + name                          = "k3s-bootstrap-0-nic"
      + network_security_group_id     = (known after apply)
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "k3s-bootstrap"
      + tags                          = (known after apply)
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + application_gateway_backend_address_pools_ids = (known after apply)
          + application_security_group_ids                = (known after apply)
          + load_balancer_backend_address_pools_ids       = (known after apply)
          + load_balancer_inbound_nat_rules_ids           = (known after apply)
          + name                                          = "k3s-bootstrap-0-nic-configuration"
          + primary                                       = (known after apply)
          + private_ip_address                            = (known after apply)
          + private_ip_address_allocation                 = "dynamic"
          + private_ip_address_version                    = "IPv4"
          + public_ip_address_id                          = (known after apply)
          + subnet_id                                     = (known after apply)
        }
    }

  # module.azure-vms.azurerm_network_interface.k3s-bootstrap-nic["k3s-bootstrap-1"] will be created
  + resource "azurerm_network_interface" "k3s-bootstrap-nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_fqdn                 = (known after apply)
      + location                      = "eastus2"
      + mac_address                   = (known after apply)
      + name                          = "k3s-bootstrap-1-nic"
      + network_security_group_id     = (known after apply)
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "k3s-bootstrap"
      + tags                          = (known after apply)
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + application_gateway_backend_address_pools_ids = (known after apply)
          + application_security_group_ids                = (known after apply)
          + load_balancer_backend_address_pools_ids       = (known after apply)
          + load_balancer_inbound_nat_rules_ids           = (known after apply)
          + name                                          = "k3s-bootstrap-1-nic-configuration"
          + primary                                       = (known after apply)
          + private_ip_address                            = (known after apply)
          + private_ip_address_allocation                 = "dynamic"
          + private_ip_address_version                    = "IPv4"
          + public_ip_address_id                          = (known after apply)
          + subnet_id                                     = (known after apply)
        }
    }

  # module.azure-vms.azurerm_network_interface.k3s-bootstrap-nic["k3s-bootstrap-2"] will be created
  + resource "azurerm_network_interface" "k3s-bootstrap-nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_fqdn                 = (known after apply)
      + location                      = "eastus2"
      + mac_address                   = (known after apply)
      + name                          = "k3s-bootstrap-2-nic"
      + network_security_group_id     = (known after apply)
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "k3s-bootstrap"
      + tags                          = (known after apply)
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + application_gateway_backend_address_pools_ids = (known after apply)
          + application_security_group_ids                = (known after apply)
          + load_balancer_backend_address_pools_ids       = (known after apply)
          + load_balancer_inbound_nat_rules_ids           = (known after apply)
          + name                                          = "k3s-bootstrap-2-nic-configuration"
          + primary                                       = (known after apply)
          + private_ip_address                            = (known after apply)
          + private_ip_address_allocation                 = "dynamic"
          + private_ip_address_version                    = "IPv4"
          + public_ip_address_id                          = (known after apply)
          + subnet_id                                     = (known after apply)
        }
    }

  # module.azure-vms.azurerm_network_interface.k3s-bootstrap-nic["k3s-bootstrap-3"] will be created
  + resource "azurerm_network_interface" "k3s-bootstrap-nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_fqdn                 = (known after apply)
      + location                      = "eastus2"
      + mac_address                   = (known after apply)
      + name                          = "k3s-bootstrap-3-nic"
      + network_security_group_id     = (known after apply)
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "k3s-bootstrap"
      + tags                          = (known after apply)
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + application_gateway_backend_address_pools_ids = (known after apply)
          + application_security_group_ids                = (known after apply)
          + load_balancer_backend_address_pools_ids       = (known after apply)
          + load_balancer_inbound_nat_rules_ids           = (known after apply)
          + name                                          = "k3s-bootstrap-3-nic-configuration"
          + primary                                       = (known after apply)
          + private_ip_address                            = (known after apply)
          + private_ip_address_allocation                 = "dynamic"
          + private_ip_address_version                    = "IPv4"
          + public_ip_address_id                          = (known after apply)
          + subnet_id                                     = (known after apply)
        }
    }

  # module.azure-vms.azurerm_network_security_group.k3s-bootstrap-nsg will be created
  + resource "azurerm_network_security_group" "k3s-bootstrap-nsg" {
      + id                  = (known after apply)
      + location            = "eastus2"
      + name                = "k3s-bootstrap"
      + resource_group_name = "k3s-bootstrap"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "SSH"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "6443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "K8S"
              + priority                                   = 1002
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = (known after apply)
    }

  # module.azure-vms.azurerm_public_ip.k3s-bootstrap-publicip["k3s-bootstrap-0"] will be created
  + resource "azurerm_public_ip" "k3s-bootstrap-publicip" {
      + allocation_method            = "Dynamic"
      + fqdn                         = (known after apply)
      + id                           = (known after apply)
      + idle_timeout_in_minutes      = 4
      + ip_address                   = (known after apply)
      + ip_version                   = "IPv4"
      + location                     = "eastus2"
      + name                         = "k3s-bootstrap-0-ip"
      + public_ip_address_allocation = (known after apply)
      + resource_group_name          = "k3s-bootstrap"
      + sku                          = "Basic"
      + tags                         = (known after apply)
    }

  # module.azure-vms.azurerm_public_ip.k3s-bootstrap-publicip["k3s-bootstrap-1"] will be created
  + resource "azurerm_public_ip" "k3s-bootstrap-publicip" {
      + allocation_method            = "Dynamic"
      + fqdn                         = (known after apply)
      + id                           = (known after apply)
      + idle_timeout_in_minutes      = 4
      + ip_address                   = (known after apply)
      + ip_version                   = "IPv4"
      + location                     = "eastus2"
      + name                         = "k3s-bootstrap-1-ip"
      + public_ip_address_allocation = (known after apply)
      + resource_group_name          = "k3s-bootstrap"
      + sku                          = "Basic"
      + tags                         = (known after apply)
    }

  # module.azure-vms.azurerm_public_ip.k3s-bootstrap-publicip["k3s-bootstrap-2"] will be created
  + resource "azurerm_public_ip" "k3s-bootstrap-publicip" {
      + allocation_method            = "Dynamic"
      + fqdn                         = (known after apply)
      + id                           = (known after apply)
      + idle_timeout_in_minutes      = 4
      + ip_address                   = (known after apply)
      + ip_version                   = "IPv4"
      + location                     = "eastus2"
      + name                         = "k3s-bootstrap-2-ip"
      + public_ip_address_allocation = (known after apply)
      + resource_group_name          = "k3s-bootstrap"
      + sku                          = "Basic"
      + tags                         = (known after apply)
    }

  # module.azure-vms.azurerm_public_ip.k3s-bootstrap-publicip["k3s-bootstrap-3"] will be created
  + resource "azurerm_public_ip" "k3s-bootstrap-publicip" {
      + allocation_method            = "Dynamic"
      + fqdn                         = (known after apply)
      + id                           = (known after apply)
      + idle_timeout_in_minutes      = 4
      + ip_address                   = (known after apply)
      + ip_version                   = "IPv4"
      + location                     = "eastus2"
      + name                         = "k3s-bootstrap-3-ip"
      + public_ip_address_allocation = (known after apply)
      + resource_group_name          = "k3s-bootstrap"
      + sku                          = "Basic"
      + tags                         = (known after apply)
    }

  # module.azure-vms.azurerm_virtual_machine.k3s-bootstrap-vm["k3s-bootstrap-0"] will be created
  + resource "azurerm_virtual_machine" "k3s-bootstrap-vm" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "eastus2"
      + name                             = "k3s-bootstrap-0"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "k3s-bootstrap"
      + tags                             = {
          + "ceph"    = "false"
          + "nfs"     = "false"
          + "storage" = "nfs"
          + "type"    = "master"
        }
      + vm_size                          = "Standard_D2S_v3"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_username = "ryan"
          + computer_name  = "k3s-bootstrap-0"
          + custom_data    = (known after apply)
        }

      + os_profile_linux_config {
          + disable_password_authentication = true

          + ssh_keys {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCwK/RgEkR8ZpOF3TuqZwDpyCQqz7DxZfiPNV/T/6zDqgEK6eAIKVtPnL4gY6Uc0Ym3Xa7WJ3uLtN1OE/4bQimSrKOjgc4x1hIfrbFNecdyA2k9oHcIVaAW3iKmWpuK/KwUhXPAB7J6UJaD1CB9Fg5tnbHUmj1bpRqrFImIyWoZT8oPH12iI7fv5N/DMFolgSG6XxVB9yuhhascYzBk6x5O8lF7Hm4gWFo4uRkDTHiKSfDKtUt2NTPDl6qFHtOlvovZEudzkzJgME0ikfCU7ckWlvyLDPPXP0R6Z4bhns3pS9tvjiMVctRgft4MW+Q9IBvnR9Nek/jdViYKQfduz7se+LLwe8eVcDLzqo95N/Z2qLh8w+Ew2ORFcjujBwGtL2hFwB0d7/9Ua5tMifbRWGyseRdjxuPzc2zbFfPzx9uIGTX/lJsvPbzlPdqGO4QM2HdWoOoriIjU4qk5QP2zpMqvNvc6vQ+2or42I6MtFySE6OUlNrvS487EPzAKgweb+OE= ryan@rynux"
              + path     = "/home/ryan/.ssh/authorized_keys"
            }
        }

      + storage_data_disk {
          + caching                   = "ReadWrite"
          + create_option             = "Empty"
          + disk_size_gb              = 10
          + lun                       = 0
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "k3s-bootstrap-0-data"
          + write_accelerator_enabled = false
        }

      + storage_image_reference {
          + offer     = "0001-com-ubuntu-server-eoan"
          + publisher = "canonical"
          + sku       = "19_10"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "k3s-bootstrap-0-OS"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.azure-vms.azurerm_virtual_machine.k3s-bootstrap-vm["k3s-bootstrap-1"] will be created
  + resource "azurerm_virtual_machine" "k3s-bootstrap-vm" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "eastus2"
      + name                             = "k3s-bootstrap-1"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "k3s-bootstrap"
      + tags                             = {
          + "ceph"    = "true"
          + "nfs"     = "false"
          + "storage" = "ceph"
          + "type"    = "nodes"
        }
      + vm_size                          = "Standard_D2S_v3"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_username = "ryan"
          + computer_name  = "k3s-bootstrap-1"
          + custom_data    = (known after apply)
        }

      + os_profile_linux_config {
          + disable_password_authentication = true

          + ssh_keys {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCwK/RgEkR8ZpOF3TuqZwDpyCQqz7DxZfiPNV/T/6zDqgEK6eAIKVtPnL4gY6Uc0Ym3Xa7WJ3uLtN1OE/4bQimSrKOjgc4x1hIfrbFNecdyA2k9oHcIVaAW3iKmWpuK/KwUhXPAB7J6UJaD1CB9Fg5tnbHUmj1bpRqrFImIyWoZT8oPH12iI7fv5N/DMFolgSG6XxVB9yuhhascYzBk6x5O8lF7Hm4gWFo4uRkDTHiKSfDKtUt2NTPDl6qFHtOlvovZEudzkzJgME0ikfCU7ckWlvyLDPPXP0R6Z4bhns3pS9tvjiMVctRgft4MW+Q9IBvnR9Nek/jdViYKQfduz7se+LLwe8eVcDLzqo95N/Z2qLh8w+Ew2ORFcjujBwGtL2hFwB0d7/9Ua5tMifbRWGyseRdjxuPzc2zbFfPzx9uIGTX/lJsvPbzlPdqGO4QM2HdWoOoriIjU4qk5QP2zpMqvNvc6vQ+2or42I6MtFySE6OUlNrvS487EPzAKgweb+OE= ryan@rynux"
              + path     = "/home/ryan/.ssh/authorized_keys"
            }
        }

      + storage_data_disk {
          + caching                   = "ReadWrite"
          + create_option             = "Empty"
          + disk_size_gb              = 10
          + lun                       = 0
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "k3s-bootstrap-1-data"
          + write_accelerator_enabled = false
        }

      + storage_image_reference {
          + offer     = "0001-com-ubuntu-server-eoan"
          + publisher = "canonical"
          + sku       = "19_10"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "k3s-bootstrap-1-OS"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.azure-vms.azurerm_virtual_machine.k3s-bootstrap-vm["k3s-bootstrap-2"] will be created
  + resource "azurerm_virtual_machine" "k3s-bootstrap-vm" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "eastus2"
      + name                             = "k3s-bootstrap-2"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "k3s-bootstrap"
      + tags                             = {
          + "ceph"    = "true"
          + "nfs"     = "false"
          + "storage" = "ceph"
          + "type"    = "nodes"
        }
      + vm_size                          = "Standard_D2S_v3"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_username = "ryan"
          + computer_name  = "k3s-bootstrap-2"
          + custom_data    = (known after apply)
        }

      + os_profile_linux_config {
          + disable_password_authentication = true

          + ssh_keys {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCwK/RgEkR8ZpOF3TuqZwDpyCQqz7DxZfiPNV/T/6zDqgEK6eAIKVtPnL4gY6Uc0Ym3Xa7WJ3uLtN1OE/4bQimSrKOjgc4x1hIfrbFNecdyA2k9oHcIVaAW3iKmWpuK/KwUhXPAB7J6UJaD1CB9Fg5tnbHUmj1bpRqrFImIyWoZT8oPH12iI7fv5N/DMFolgSG6XxVB9yuhhascYzBk6x5O8lF7Hm4gWFo4uRkDTHiKSfDKtUt2NTPDl6qFHtOlvovZEudzkzJgME0ikfCU7ckWlvyLDPPXP0R6Z4bhns3pS9tvjiMVctRgft4MW+Q9IBvnR9Nek/jdViYKQfduz7se+LLwe8eVcDLzqo95N/Z2qLh8w+Ew2ORFcjujBwGtL2hFwB0d7/9Ua5tMifbRWGyseRdjxuPzc2zbFfPzx9uIGTX/lJsvPbzlPdqGO4QM2HdWoOoriIjU4qk5QP2zpMqvNvc6vQ+2or42I6MtFySE6OUlNrvS487EPzAKgweb+OE= ryan@rynux"
              + path     = "/home/ryan/.ssh/authorized_keys"
            }
        }

      + storage_data_disk {
          + caching                   = "ReadWrite"
          + create_option             = "Empty"
          + disk_size_gb              = 10
          + lun                       = 0
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "k3s-bootstrap-2-data"
          + write_accelerator_enabled = false
        }

      + storage_image_reference {
          + offer     = "0001-com-ubuntu-server-eoan"
          + publisher = "canonical"
          + sku       = "19_10"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "k3s-bootstrap-2-OS"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.azure-vms.azurerm_virtual_machine.k3s-bootstrap-vm["k3s-bootstrap-3"] will be created
  + resource "azurerm_virtual_machine" "k3s-bootstrap-vm" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "eastus2"
      + name                             = "k3s-bootstrap-3"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "k3s-bootstrap"
      + tags                             = {
          + "ceph"    = "true"
          + "nfs"     = "true"
          + "storage" = "ceph"
          + "type"    = "nodes"
        }
      + vm_size                          = "Standard_D2S_v3"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_username = "ryan"
          + computer_name  = "k3s-bootstrap-3"
          + custom_data    = (known after apply)
        }

      + os_profile_linux_config {
          + disable_password_authentication = true

          + ssh_keys {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCwK/RgEkR8ZpOF3TuqZwDpyCQqz7DxZfiPNV/T/6zDqgEK6eAIKVtPnL4gY6Uc0Ym3Xa7WJ3uLtN1OE/4bQimSrKOjgc4x1hIfrbFNecdyA2k9oHcIVaAW3iKmWpuK/KwUhXPAB7J6UJaD1CB9Fg5tnbHUmj1bpRqrFImIyWoZT8oPH12iI7fv5N/DMFolgSG6XxVB9yuhhascYzBk6x5O8lF7Hm4gWFo4uRkDTHiKSfDKtUt2NTPDl6qFHtOlvovZEudzkzJgME0ikfCU7ckWlvyLDPPXP0R6Z4bhns3pS9tvjiMVctRgft4MW+Q9IBvnR9Nek/jdViYKQfduz7se+LLwe8eVcDLzqo95N/Z2qLh8w+Ew2ORFcjujBwGtL2hFwB0d7/9Ua5tMifbRWGyseRdjxuPzc2zbFfPzx9uIGTX/lJsvPbzlPdqGO4QM2HdWoOoriIjU4qk5QP2zpMqvNvc6vQ+2or42I6MtFySE6OUlNrvS487EPzAKgweb+OE= ryan@rynux"
              + path     = "/home/ryan/.ssh/authorized_keys"
            }
        }

      + storage_data_disk {
          + caching                   = "ReadWrite"
          + create_option             = "Empty"
          + disk_size_gb              = 10
          + lun                       = 0
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "k3s-bootstrap-3-data"
          + write_accelerator_enabled = false
        }

      + storage_image_reference {
          + offer     = "0001-com-ubuntu-server-eoan"
          + publisher = "canonical"
          + sku       = "19_10"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "k3s-bootstrap-3-OS"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Azure E2E`, Action: `hashicorpterraform-github-actions4`, Working Directory: `test/terraform`*
